# Working with Time and Date

In [73]:
import pandas as pd
import numpy as np

In [75]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [77]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [79]:
date.shape

(1000, 4)

In [81]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [83]:
time.shape

(1000, 2)

In [85]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [87]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with dates

In [89]:
# Converting to datetime datatype ---------------------------------->

date['date'] = pd.to_datetime(date['date'])

In [91]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1. Extract Year

In [93]:
date['date_year'] = date['date'].dt.year

In [95]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## 2. Extract Month ---------->

In [97]:
date['date_month_no'] = date['date'].dt.month

In [99]:
date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [101]:
date['date_month_name'] = date['date'].dt.month_name()

In [103]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

## 3. Extract days ------------>

In [106]:
date['date_day'] = date['date'].dt.day

In [108]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [110]:
# day of Week------------------------->  Week ka konsa din hai ------>
date['date_dow'] = date['date'].dt.dayofweek

In [112]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [114]:
date['date_day_name'] = date['date'].dt.day_name()

In [116]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_day_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [118]:
# day is Weekend or not?

date['date_is_weekend'] = np.where(date['date_day_name'].isin(['Sunday','Saturday']), 1 , 0)

date.drop(columns =['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_day_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

## 4. Extract week of the year

In [123]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns =['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_day_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

## 5. Extract Quarter

In [126]:
date['quarter'] = date['date'].dt.quarter
date.drop(columns =['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_day_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

## 6. Extract Semester  ---------------------->

In [133]:
date['semester'] = np.where(date['date_month_no'].isin([1,2]),1,2)

date.drop(columns =['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_day_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

# Extract Time elapsed between dates

In [138]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 6, 6, 23, 21, 24, 976425)

In [140]:
today - date['date']

0     2005 days 23:21:24.976425
1     2487 days 23:21:24.976425
2     2418 days 23:21:24.976425
3     2120 days 23:21:24.976425
4     2343 days 23:21:24.976425
                 ...
995   2433 days 23:21:24.976425
996   2374 days 23:21:24.976425
997   2222 days 23:21:24.976425
998   2287 days 23:21:24.976425
999   2061 days 23:21:24.976425
Name: date, Length: 1000, dtype: timedelta64[ns]

In [142]:
(today - date['date']).dt.days

0      2005
1      2487
2      2418
3      2120
4      2343
       ...
995    2433
996    2374
997    2222
998    2287
999    2061
Name: date, Length: 1000, dtype: int64

In [150]:
# Months Passed -------------------------------->

# np.round((today-date['date']) / np.timedelta64(1,'M'),0)

# Working with Time ------------>

In [153]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [155]:
time['date'] = pd.to_datetime(time['date'])

In [157]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [159]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [161]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

## Extract time part

In [164]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [166]:
today - time['date']

0     4191 days 22:31:24.976425
1     4055 days 23:41:24.976425
2     4541 days 23:00:24.976425
3     3843 days 22:50:24.976425
4     4241 days 00:10:24.976425
                 ...
995   4830 days 22:31:24.976425
996   4152 days 00:07:24.976425
997   4616 days 23:44:24.976425
998   4732 days 23:47:24.976425
999   4004 days 23:56:24.976425
Name: date, Length: 1000, dtype: timedelta64[ns]

In [168]:
# in seconds ----------------->

(today-date['date']) / np.timedelta64(1,'s')

0      1.733161e+08
1      2.149609e+08
2      2.089993e+08
3      1.832521e+08
4      2.025193e+08
           ...
995    2.102953e+08
996    2.051977e+08
997    1.920649e+08
998    1.976809e+08
999    1.781545e+08
Name: date, Length: 1000, dtype: float64

In [170]:
# in minutes ----------------->

(today-date['date']) / np.timedelta64(1,'m')

0      2.888601e+06
1      3.582681e+06
2      3.483321e+06
3      3.054201e+06
4      3.375321e+06
           ...
995    3.504921e+06
996    3.419961e+06
997    3.201081e+06
998    3.294681e+06
999    2.969241e+06
Name: date, Length: 1000, dtype: float64

In [172]:
# in hours ----------------->

(today-date['date']) / np.timedelta64(1,'h')

0      48143.356938
1      59711.356938
2      58055.356938
3      50903.356938
4      56255.356938
           ...
995    58415.356938
996    56999.356938
997    53351.356938
998    54911.356938
999    49487.356938
Name: date, Length: 1000, dtype: float64